// Завдання 1: Пароль і 4 спроби. Завдання виконуємо через цикл while або do while
// 1). Запросити у користувача пароль!
// 2). Якщо пароль не вірний повідомити що залишилось 4 спроби!
// - якщо далі невірні паролі спроби зменшуються.
// - коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".
// 3). Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!".
// 4). БЕЗ break!!!!!!!!!!!!!

let indexPasword = 4;
let pasword = "true";

while(indexPasword !== 0){
    let paswordPrompt = prompt("Введіть пароль");
    if(paswordPrompt === pasword){
        alert("Ласкаво Просимо");
        indexPasword = 0;
    }
    else{
        indexPasword--;
        if (indexPasword !== 0 ){
        alert("Залишилося: " + indexPasword + " спроби")
        }
        else{
            alert("Спробуйте пізніше");
            window.close();
        }
    }
}

document.write("Ласкаво Просимо");