// 1 завдання. Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.

let a = prompt("Введіть число");
let factorial = 1;

for (let i = 1; i <= a; i++) {
    factorial *= i;
}
console.log(factorial);


// 2 завдання.     Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 ….

let sum = 0;
for (let i = 0; i < 5; i++) {
    if(sum < 1000) sum = 1000;
    sum = sum + 3;
    console.log(sum);
}


// 3 завдання.     Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17 ....

for (let i = 1; i <= 55; i+=2) {
    console.log(i);
}


// 4 завдання.     Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 ....

for (let index = 90; index >= 0; index -= 5) {
    console.log(index);
}


// 5 завдання.     Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128 ....

let sequence = 1;
for (let index = 0; index <= 20; index++) {
    sequence *= 2;
    console.log(sequence);
}


// 8 завдання.     Написати програму що обчислює піднесення до степеня. 1 промпт вводиться число в 2 степінь.
// Умови: Степінь може бути додатній, від'ємний або 0.
// Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл!
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;

const num = prompt("Введіть число");
let b = prompt("Введіть степінь");
let sum    =  1;

let m = Math.abs(b);

for (let index = m; index > 0; index--) {
    if(m > 0){
        sum = sum * num;
    }
    else if(b == 0){
        sum = 1;
    }
}

if(b < 0){
    sum = 1 / sum;
}

console.log(sum);











